       IDENTIFICATION DIVISION.
       PROGRAM-ID. "EquaçãoGrau".
       AUTHOR. "EU MESMO".

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      * SELECT XPTO0001 ASSIGN TO ARQ00TXT
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
           01 WS-A PIC 9(003) VALUE 0.
           01 WS-B PIC 9(003) VALUE ZEROES.
           01 WS-C PIC 9(006) VALUES ZEROS.
           01 WS-DELTA PIC 9(006) VALUES ZEROES.
      *01 WS-PERIMETRO PIC 9(006) VALUES ZERO.
      *01 WS-PAUSA PIC X(001) VALUES SPACE.
       PROCEDURE DIVISION.
       000-INICIO.
           DISPLAY "Equação do 2° Grau"
           DISPLAY "A (Diferente de 0): "
      *001-ACEITA_A.
           ACCEPT WS-A
           IF WS-A <>0
           THEN
               DISPLAY "A TEM QUE SER DIFERENTE DE ZERO"
           ELSE
           DISPLAY "B: "
           ACCEPT WS-B
           DISPLAY "C: "
           ACCEPT WS-C

           COMPUTE (WS-B * WS-B) -4 * WS-A * WS-C TO WS-DELTA
           DISPLAY "DELTA : " DELTA
      *MULTIPLY WS-LARGURA BY WS-ALTURA GIVING WS-AREA

      *    MOVE ZEROS TO WS-PERIMETRO
      *    ADD WS-LARGURA TO WS-LARGURA GIVING WS-PERIMETRO
      *    ADD WS-ALTURA  TO WS-ALTURA
      *    ADD WS-ALTURA  TO WS-PERIMETRO


      *    DISPLAY "ÁREA     : " WS-AREA
      *    DISPLAY "PERIMETRO: " WS-PERIMETRO

      *    ACCEPT WS-PAUSA


           STOP RUN.
      *LINKAGE SECTION.
      *SCREEN SECTION.
